docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-07 mer. 10:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reproducing Spectre Attack with gem5, How To Do It Right?</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pierre Ayoub" />
<link rel="stylesheet" href="https://sandyuraz.com/styles/org.min.css">
</head>
<body>
<div id="content">
<h1 class="title">Reproducing Spectre Attack with gem5, How To Do It Right?</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org65a11dc">1. Introduction</a></li>
<li><a href="#org5650048">2. Repository</a></li>
<li><a href="#org72cb97e">3. HowTo</a>
<ul>
<li><a href="#setup_arm">3.1. How to Setup the Native ARM System</a></li>
<li><a href="#howto_spectre">3.2. How to Perform the Spectre Attack</a></li>
<li><a href="#howto_gem5_setup">3.3. How to Setup gem5 for a Full-System Simulation</a></li>
<li><a href="#howto_gem5">3.4. How to Simulate Spectre with gem5</a></li>
<li><a href="#howto_konata">3.5. How to Visualize the Pipeline of a gem5 Processor with Konata</a></li>
</ul>
</li>
<li><a href="#org1041c95">4. Implementations</a>
<ul>
<li><a href="#implem_spectre">4.1. Spectre</a></li>
<li><a href="#implem_gem5">4.2. gem5</a></li>
</ul>
</li>
<li><a href="#org166628e">5. Appendices</a></li>
</ul>
</div>
</div>

<div id="outline-container-org65a11dc" class="outline-2">
<h2 id="org65a11dc"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This web page is linked to the <i><a href="https://github.com/pierreay/reproduce-spectre-gem5/blob/main/docs/paper.pdf">Reproducing Spectre Attack with gem5, How To
Do It Right?</a></i> paper, as well with the <i><a href="https://github.com/pierreay/reproduce-spectre-gem5/blob/main/docs/master_thesis.pdf">Simulating Transient Execution Attacks
with gem5</a></i> master thesis.
</p>

<p>
It will guide you through the reproduction of the experiments, the usage of
our implementations or through the demonstration of some techniques discussed
in the paper. You can navigate with the table of content, or directly click
below to:
</p>
<ul class="org-ul">
<li><a href="#howto_spectre">Learn how to perform a Spectre attack with our implementation</a></li>
<li><a href="#howto_spectre">Learn how to simulate Spectre with gem5</a></li>
<li><a href="#howto_konata">Learn how to visualize the pipeline of a simulated processor with Konata</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5650048" class="outline-2">
<h2 id="org5650048"><span class="section-number-2">2</span> Repository</h2>
<div class="outline-text-2" id="text-2">
<p>
This web page is part of the repository located <a href="https://github.com/pierreay/reproduce-spectre-gem5">here</a>. See the <code>README.md</code>
file for repository organization and navigation.
</p>
</div>
</div>

<div id="outline-container-org72cb97e" class="outline-2">
<h2 id="org72cb97e"><span class="section-number-2">3</span> HowTo</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-setup_arm" class="outline-3">
<h3 id="setup_arm"><span class="section-number-3">3.1</span> How to Setup the Native ARM System</h3>
<div class="outline-text-3" id="text-setup_arm">
<p>
To reproduce this work, you will need:
</p>
<ul class="org-ul">
<li>An ARM board. We used a <a href="https://static.raspberrypi.org/files/product-briefs/200521+Raspberry+Pi+4+Product+Brief.pdf">Raspberry Pi v4 Model B Rev 1.1</a> embedding a <a href="http://infocenter.arm.com/help/topic/com.arm.doc.100095_0003_06_en/cortex_a72_mpcore_trm_100095_0003_06_en.pdf">ARM
Cortex-A72</a> (ARMv8-A) processor implemented in a SoC <a href="https://www.raspberrypi.org/documentation/hardware/raspberrypi/bcm2711/rpi_DATA_2711_1p0.pdf">Broadcom BCM2711</a>.</li>
<li>A 64-bit operating system (kernel and userland) for ARM. We used <a href="https://www.offensive-security.com/kali-linux-arm-images/">Kali
Linux</a> (stable v2020.2a, with a Linux kernel v4.19.118-Re4son-v8l+ and a
GCC compiler v9.3), because:
<ol class="org-ol">
<li>It is a full 64-bit operating system supporting ARM,</li>
<li>The kernel is nearly the same as the one provided by gem5,</li>
<li>The kernel sources and headers are available with <code>apt</code> (for developing
kernel modules, if you do so).</li>
</ol></li>
</ul>

<p>
Install the Kali Linux distribution. First, download the image:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #91b9c7;">cd</span> /tmp
<span style="color: #47ba99;">zip</span>=<span style="color: #fbaed2;">"kali.xz"</span>
<span style="color: #47ba99;">img</span>=<span style="color: #fbaed2;">"kali.img"</span>
wget -O <span style="color: #fbaed2;">"$zip"</span> https://images.offensive-security.com/arm-images/kali-linux-2020.2a-rpi3-nexmon-64.img.xz
xzcat <span style="color: #fbaed2;">"$zip"</span> &gt; <span style="color: #fbaed2;">"$img"</span>
rm -f <span style="color: #fbaed2;">"$zip"</span>
</pre>
</div>

<p>
Then, insert your SD card in your computer, and make sure that device block
name is correct (find it with <code>lsblk</code> and <code>umount</code> it if it has been
automatically mounted). Bit-copy the image on the SD card:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #47ba99;">sdcard</span>=/dev/sdd
sudo dd <span style="color: #47ba99;">bs</span>=<span style="color: #ef6787;">4M</span> <span style="color: #47ba99;">if</span>=<span style="color: #fbaed2;">"$img"</span> <span style="color: #47ba99;">of</span>=<span style="color: #fbaed2;">"$sdcard"</span> <span style="color: #47ba99;">status</span>=progress <span style="color: #47ba99;">conv</span>=fsync
rm -f <span style="color: #fbaed2;">"$img"</span>
</pre>
</div>

<p>
Now, plug the SD card in the Raspberry Pi, plug an Ethernet cable and plug
the power cable in it. Then, find the IP address associated to it and
connect with the <code>kali</code> login and <code>kali</code> password:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #47ba99;">ip</span>=<span style="color: #fbaed2;">"192.168.1.1"</span> <span style="color: #697375;"># </span><span style="color: #697375;">Find the correct IP.</span>
ssh kali@$<span style="color: #47ba99;">ip</span>
<span style="color: #697375;"># </span><span style="color: #697375;">We install the following software:</span>
sudo apt-get update &amp;&amp; sudo apt-get upgrade
sudo apt-get -y install linux-cpupower git
</pre>
</div>

<p>
You can log in the <code>root</code> account by issuing the command <code>sudo su root</code> if
needed.
</p>

<p>
You are now ready to reproduce Spectre on the Raspberry Pi.
</p>
</div>
</div>
