docs/index.html

<div id="outline-container-howto_spectre" class="outline-3">
<h3 id="howto_spectre"><span class="section-number-3">3.2</span> How to Perform the Spectre Attack</h3>
<div class="outline-text-3" id="text-howto_spectre">
<p>
We assume that you are on the ARM system described in Section <a href="#setup_arm">3.1</a> or
an equivalent one.
</p>

<p>
First, clone the repository:
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/pierreay/reproduce-spectre-gem5
<span style="color: #697375;"># </span><span style="color: #697375;">We will use this variable to designate the repository through the hole file.</span>
<span style="color: #47ba99;">reproducing_repo</span>=<span style="color: #fbaed2;">"$(pwd)/reproduce-spectre-gem5"</span>
<span style="color: #91b9c7;">cd</span> <span style="color: #fbaed2;">"$reproducing_repo"</span>
</pre>
</div>

<p>
Simply use the <code>Makefile</code> to compile our implementation, described in
Section <a href="#implem_spectre">4.1</a>:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #91b9c7;">cd</span> spectre &amp;&amp; make
</pre>
</div>

<p>
Test if the binary is working by displaying a useful help message:
</p>

<div class="org-src-container">
<pre class="src src-bash">./spectre --help
</pre>
</div>

<pre class="example" id="orga9c14e6">
Usage: spectre [OPTION...]
Spectre -- A Spectre implementation useful for research

  -c, --cache_threshold=NUMBER   Cache threshold separating hit and miss
                             (default: automatically computed)
  -l, --loops=NUMBER         Number of loops (training and attack) per attempts
                             (default: 30)
  -m, --meta=NUMBER          Number of meta-repetition of Spectre (default: 1)
  -q, -s, --quiet, --silent  Don't produce the header for csv
  -t, --tries=NUMBER         Number of attempts to guess a secret byte
                             (default: 999)
  -v, --verbose              Produce verbose output
  -?, --help                 Give this help list
      --usage                Give a short usage message
  -V, --version              Print program version

Mandatory or optional arguments to long options are also mandatory or optional
for any corresponding short options.

Report bugs to &lt;pierre.ayoub@irisa.fr&gt;.
</pre>

<p>
And test the attack with the default parameters like this:
</p>

<div class="org-src-container">
<pre class="src src-bash">./spectre 
</pre>
</div>

<p>
If it works correctly, you surely want to generate the metrics as we do in
the paper and customize some parameters. The metrics will be generated in a
<code>csv</code> format, you can then redirect them to a file. To do so, we use this
loop to repeat the hole experiment. We first launch one experiment, and
relaunch the others with the <code>-q</code> flag to suppress header line:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #697375;"># </span><span style="color: #697375;">Parameters.</span>
<span style="color: #47ba99;">runs</span>=<span style="color: #ef6787;">50</span> <span style="color: #697375;"># </span><span style="color: #697375;">Number of runs - 1.</span>
<span style="color: #47ba99;">m</span>=<span style="color: #ef6787;">10</span>    <span style="color: #697375;"># </span><span style="color: #697375;">Number of meta repetition in the binary itself.</span>
<span style="color: #47ba99;">t</span>=<span style="color: #ef6787;">999</span>   <span style="color: #697375;"># </span><span style="color: #697375;">Number of attempts to guess one byte.</span>
<span style="color: #47ba99;">l</span>=<span style="color: #ef6787;">100</span>   <span style="color: #697375;"># </span><span style="color: #697375;">Number of loop per attempt.</span>
<span style="color: #697375;"># </span><span style="color: #697375;">Runs.</span>
./spectre/spectre -m $<span style="color: #47ba99;">m</span> -l $<span style="color: #47ba99;">l</span> -t $<span style="color: #47ba99;">t</span>
<span style="color: #4EB8CA;">for</span> <span style="color: #4EB8CA;">(</span><span style="color: #91b9c7;">(</span> <span style="color: #47ba99;">i</span> = <span style="color: #ef6787;">1</span>; i &lt; $<span style="color: #47ba99;">runs</span>; i++ <span style="color: #91b9c7;">)</span><span style="color: #4EB8CA;">)</span>
<span style="color: #4EB8CA;">do</span>  
    ./spectre/spectre -q -m $<span style="color: #47ba99;">m</span> -l $<span style="color: #47ba99;">l</span> -t $<span style="color: #47ba99;">t</span>   
<span style="color: #4EB8CA;">done</span>
</pre>
</div>

<p>
<b>Optional</b>. If you want to obtain the <code>perf_event</code> metrics under a gem5
simulation, you will have to recompile the Spectre binary with a patch. This
is still a <code>TODO</code> item in the source code. To do that, use <code>git-apply</code> to
apply the patch, save the previously compiled binary with another name and
relaunch <code>make</code>:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #697375;"># </span><span style="color: #697375;">Apply the patch</span>
<span style="color: #91b9c7;">cd</span> <span style="color: #fbaed2;">"$reproduce_repo"</span>
git apply spectre/perf.c.patch
<span style="color: #697375;"># </span><span style="color: #697375;">Save the previous binary</span>
<span style="color: #91b9c7;">cd</span> spectre
mv spectre spectre_native
<span style="color: #697375;"># </span><span style="color: #697375;">Compile the new Spectre</span>
make
</pre>
</div>
</div>
</div>
