docs/index.org
** How to Setup gem5 for a Full-System Simulation
   :PROPERTIES:
   :CUSTOM_ID: howto_gem5_setup
   :END:

   To reproduce this work, you will need:
   - A working [[https://www.gem5.org/getting_started/][gem5]] installation. We used gem5 v20.0.
   - An [[https://www.gem5.org/documentation/general_docs/fullsystem/guest_binaries][operating system image and a kernel image]] ready-to-use with gem5. We
     used the [[http://dist.gem5.org/dist/current/arm/disks/linaro-minimal-aarch64.img.bz2][64-bit Linaro Minimal v7.4.0 (based on Ubuntu)]] and the [[http://dist.gem5.org/dist/current/arm/aarch-system-201901106.tar.bz2][ARM64
     Linux kernel v4.18.0]] images provided by gem5's developers.

   Note that this gem5 version and the images are now obsolete. You can of
   course follow our steps, but then for a new research, it would be better to
   use the latest gem5 version and images with the new recommended methods
   (e.g., Docker container).

   First, install the recommended packages:

   #+BEGIN_SRC bash :eval never
   sudo apt install build-essential git m4 scons zlib1g zlib1g-dev \
       libprotobuf-dev protobuf-compiler libprotoc-dev libgoogle-perftools-dev \
       python3-dev python3-six python libboost-all-dev pkg-config
   #+END_SRC

   Clone the gem5 repository:

   #+BEGIN_SRC bash :eval never
   git clone https://gem5.googlesource.com/public/gem5
   # We will use this variable to designate the gem5 repository through the hole
   # file.
   gem5_repo="$(pwd)/gem5"
   cd "$gem5_repo"
   #+END_SRC

   Checkout the commit for version 20.0:

   #+BEGIN_SRC bash :eval never
   git checkout v20.0.0.0
   #+END_SRC

   *Optional*. If you want to obtain the =perf_event= metrics under a gem5
   simulation, you will have to apply a patch from our repository to the gem5
   source code to enable =perf_event= on the gem5 side (note that it should not
   be required on the latest gem5 version). To do that, use:

   #+BEGIN_SRC bash
   git apply "$reproduce_repo/gem5/perf_event.patch"
   #+END_SRC

   #+BEGIN_SRC diff :tangle ../gem5/perf_event.patch :exports none
   diff --git i/src/arch/arm/ArmISA.py w/src/arch/arm/ArmISA.py
   index 2641ec3fb..3d85c1b75 100644
   --- i/src/arch/arm/ArmISA.py
   +++ w/src/arch/arm/ArmISA.py
   @@ -36,6 +36,7 @@
   from m5.params import *
   from m5.proxy import *

   +from m5.SimObject import SimObject
   from m5.objects.ArmPMU import ArmPMU
   from m5.objects.ArmSystem import SveVectorLength
   from m5.objects.BaseISA import BaseISA
   @@ -49,6 +50,8 @@ class ArmISA(BaseISA):
   cxx_class = 'ArmISA::ISA'
   cxx_header = "arch/arm/isa.hh"

   +    generateDeviceTree = SimObject.recurseDeviceTree
   +
   system = Param.System(Parent.any, "System this ISA object belongs to")

   pmu = Param.ArmPMU(NULL, "Performance Monitoring Unit")
   diff --git i/src/arch/arm/ArmPMU.py w/src/arch/arm/ArmPMU.py
   index 047e908b3..58553fbf9 100644
   --- i/src/arch/arm/ArmPMU.py
   +++ w/src/arch/arm/ArmPMU.py
   @@ -40,6 +40,7 @@ from m5.params import *
   from m5.params import isNullPointer
   from m5.proxy import *
   from m5.objects.Gic import ArmInterruptPin
   +from m5.util.fdthelper import *

   class ProbeEvent(object):
   def __init__(self, pmu, _eventId, obj, *listOfNames):
   @@ -76,6 +77,17 @@ class ArmPMU(SimObject):

   _events = None

   +    def generateDeviceTree(self, state):
   +        node = FdtNode("pmu")
   +        node.appendCompatible("arm,armv8-pmuv3")
   +        # gem5 uses GIC controller interrupt notation, where PPI interrupts
   +        # start to 16. However, the Linux kernel start from 0, and used a tag
   +        # (set to 1) to indicate the PPI interrupt type.
   +        node.append(FdtPropertyWords("interrupts", [
   +            1, int(self.interrupt.num) - 16, 0xf04
   +        ]))
   +        yield node
   +
   def addEvent(self, newObject):
   if not (isinstance(newObject, ProbeEvent)
   or isinstance(newObject, SoftwareIncrement)):
   diff --git i/src/cpu/BaseCPU.py w/src/cpu/BaseCPU.py
   index ab70d1d7f..66a49a038 100644
   --- i/src/cpu/BaseCPU.py
   +++ w/src/cpu/BaseCPU.py
   @@ -302,6 +302,11 @@ class BaseCPU(ClockedObject):
   node.appendPhandle(phandle_key)
   cpus_node.append(node)

   +        # Generate nodes from the BaseCPU children (and don't add them as
   +        # subnode). Please note: this is mainly needed for the ISA class.
   +        for child_node in self.recurseDeviceTree(state):
   +            yield child_node
   +
   yield cpus_node

   def __init__(self, **kwargs):
   #+END_SRC

   And finally, compile it in optimized mode (=opt=), for the ARM architecture
   (=ARM=), with 8 cores and for Python 3. It can take several hours:

   #+BEGIN_SRC bash :eval never
   mode="opt"
   arch="ARM"
   cores=8
   py_version=3 
   scons PYTHON_CONFIG=python$py_version-config build/$arch/gem5.$mode -j $cores
   #+END_SRC

    If everything is working, you should be able to display the help of one
    simulation script:

    #+BEGIN_SRC bash :eval never
    build/ARM/gem5.opt -q configs/example/arm/starter_fs.py --help   
    #+END_SRC

    Otherwise, check the [[https://pierreay.github.io/reproduce-spectre-gem5/gem5_errors.html#compilation][=docs/gem5_errors.html=]] file to see if the compilation
    error has already been encountered.
    
    Let's create the images you need to perform a full-system
    simulation. First, you have to download the operating system and the kernel
    images that you will use over our simulated hardware:

    #+BEGIN_SRC bash :eval never
    img_dir=img
    mkdir $img_dir && cd $img_dir
    # OS
    wget -O - http://dist.gem5.org/dist/current/arm/disks/linaro-minimal-aarch64.img.bz2 | bunzip2 > linaro-minimal-aarch64.img
    # Kernel
    wget -O - http://dist.gem5.org/dist/current/arm/aarch-system-201901106.tar.bz2 | tar xjv
    #+END_SRC

    Then, you will have to create a third =workload.img= image that will
    contain the file(s) that you want to use in your experiments. In order to
    do that, first create a 100MB zero file (you can change the size with the
    =count= parameter):

    #+BEGIN_SRC bash :eval never
    img=workload.img
    dd if=/dev/zero of=$img count=200K
    #+END_SRC

    Create a loopback device in order to access the image as a block device:

    #+BEGIN_SRC bash :eval never
    dev=$(sudo losetup -f)
    sudo losetup -fP $img
    #+END_SRC

    Create a DOS partition table and a primary partition on the entire image,
    then format the new created partition with the =ext4= file system:

    #+BEGIN_SRC bash :eval never
    echo "," | sudo sfdisk $dev
    sudo mke2fs "$dev"p1
    #+END_SRC
    
    Finally, you are done at modifying your image, detach it from the loopback
    device:

    #+BEGIN_SRC bash :eval never
    sudo losetup -d $dev
    #+END_SRC

    Now, you have a persistent file that will hold your files for the
    simulation. Define a function that will be used each time you need to
    update the image with new files (binaries, data...):

    #+BEGIN_SRC bash :eval never
    # $1: workload image name/path.
    # $*: list of files to copy.
    workload_update() {
        dev=$(sudo losetup -f)
        mnt=/mnt/workload
        # Get arguments.
        img="$1"
        shift
        # Create the mount folder and the loop device.
        sudo mkdir -p $mnt
        sudo losetup -fP "$img"
        # Mount the block device.
        sudo mount -o loop $dev $mnt
        # Copy files/folders.
        sudo cp -r -f -t $mnt $*
        # List the files to confirm.
        ls -alh $mnt
        # Unmount the image and freed the loop device.
        sudo umount $mnt
        sudo losetup -d $dev
    }
    #+END_SRC

    We will use this function later. All your 3 images will be mounted directly
    in the simulated system by gem5 itself, and the files in the workload image
    will be accessible in read/write. This is an efficient and handy way to
    communicate with a gem5 simulation.

