docs/index.html

<div id="outline-container-howto_gem5_setup" class="outline-3">
<h3 id="howto_gem5_setup"><span class="section-number-3">3.3</span> How to Setup gem5 for a Full-System Simulation</h3>
<div class="outline-text-3" id="text-howto_gem5_setup">
<p>
To reproduce this work, you will need:
</p>
<ul class="org-ul">
<li>A working <a href="https://www.gem5.org/getting_started/">gem5</a> installation. We used gem5 v20.0.</li>
<li>An <a href="https://www.gem5.org/documentation/general_docs/fullsystem/guest_binaries">operating system image and a kernel image</a> ready-to-use with gem5. We
used the <a href="http://dist.gem5.org/dist/current/arm/disks/linaro-minimal-aarch64.img.bz2">64-bit Linaro Minimal v7.4.0 (based on Ubuntu)</a> and the <a href="http://dist.gem5.org/dist/current/arm/aarch-system-201901106.tar.bz2">ARM64
Linux kernel v4.18.0</a> images provided by gem5's developers.</li>
</ul>

<p>
Note that this gem5 version and the images are now obsolete. You can of
course follow our steps, but then for a new research, it would be better to
use the latest gem5 version and images with the new recommended methods
(e.g., Docker container).
</p>

<p>
First, install the recommended packages:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo apt install build-essential git m4 scons zlib1g zlib1g-dev <span style="color: #fbaed2;">\</span>
    libprotobuf-dev protobuf-compiler libprotoc-dev libgoogle-perftools-dev <span style="color: #fbaed2;">\</span>
    python3-dev python3-six python libboost-all-dev pkg-config
</pre>
</div>

<p>
Clone the gem5 repository:
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://gem5.googlesource.com/public/gem5
<span style="color: #697375;"># </span><span style="color: #697375;">We will use this variable to designate the gem5 repository through the hole</span>
<span style="color: #697375;"># </span><span style="color: #697375;">file.</span>
<span style="color: #47ba99;">gem5_repo</span>=<span style="color: #fbaed2;">"$(pwd)/gem5"</span>
<span style="color: #91b9c7;">cd</span> <span style="color: #fbaed2;">"$gem5_repo"</span>
</pre>
</div>

<p>
Checkout the commit for version 20.0:
</p>

<div class="org-src-container">
<pre class="src src-bash">git checkout v20.0.0.0
</pre>
</div>

<p>
<b>Optional</b>. If you want to obtain the <code>perf_event</code> metrics under a gem5
simulation, you will have to apply a patch from our repository to the gem5
source code to enable <code>perf_event</code> on the gem5 side (note that it should not
be required on the latest gem5 version). To do that, use:
</p>

<div class="org-src-container">
<pre class="src src-bash">git apply <span style="color: #fbaed2;">"$reproduce_repo/gem5/perf_event.patch"</span>
</pre>
</div>

<p>
And finally, compile it in optimized mode (<code>opt</code>), for the ARM architecture
(<code>ARM</code>), with 8 cores and for Python 3. It can take several hours:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #47ba99;">mode</span>=<span style="color: #fbaed2;">"opt"</span>
<span style="color: #47ba99;">arch</span>=<span style="color: #fbaed2;">"ARM"</span>
<span style="color: #47ba99;">cores</span>=<span style="color: #ef6787;">8</span>
<span style="color: #47ba99;">py_version</span>=<span style="color: #ef6787;">3</span> 
scons <span style="color: #47ba99;">PYTHON_CONFIG</span>=python$<span style="color: #47ba99;">py_version</span>-config build/$<span style="color: #47ba99;">arch</span>/gem5.$<span style="color: #47ba99;">mode</span> -j $<span style="color: #47ba99;">cores</span>
</pre>
</div>

<p>
If everything is working, you should be able to display the help of one
simulation script:
</p>

<div class="org-src-container">
<pre class="src src-bash">build/ARM/gem5.opt -q configs/example/arm/starter_fs.py --help   
</pre>
</div>

<p>
Otherwise, check the <a href="https://pierreay.github.io/reproduce-spectre-gem5/gem5_errors.html#compilation"><code>docs/gem5_errors.html</code></a> file to see if the compilation
error has already been encountered.
</p>

<p>
Let's create the images you need to perform a full-system
simulation. First, you have to download the operating system and the kernel
images that you will use over our simulated hardware:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #47ba99;">img_dir</span>=img
mkdir $<span style="color: #47ba99;">img_dir</span> &amp;&amp; <span style="color: #91b9c7;">cd</span> $<span style="color: #47ba99;">img_dir</span>
<span style="color: #697375;"># </span><span style="color: #697375;">OS</span>
wget -O - http://dist.gem5.org/dist/current/arm/disks/linaro-minimal-aarch64.img.bz2 | bunzip2 &gt; linaro-minimal-aarch64.img
<span style="color: #697375;"># </span><span style="color: #697375;">Kernel</span>
wget -O - http://dist.gem5.org/dist/current/arm/aarch-system-201901106.tar.bz2 | tar xjv
</pre>
</div>

<p>
Then, you will have to create a third <code>workload.img</code> image that will
contain the file(s) that you want to use in your experiments. In order to
do that, first create a 100MB zero file (you can change the size with the
<code>count</code> parameter):
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #47ba99;">img</span>=workload.img
dd <span style="color: #47ba99;">if</span>=/dev/zero <span style="color: #47ba99;">of</span>=$<span style="color: #47ba99;">img</span> <span style="color: #47ba99;">count</span>=<span style="color: #ef6787;">200K</span>
</pre>
</div>

<p>
Create a loopback device in order to access the image as a block device:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #47ba99;">dev</span>=$<span style="color: #4EB8CA;">(</span>sudo losetup -f<span style="color: #4EB8CA;">)</span>
sudo losetup -fP $<span style="color: #47ba99;">img</span>
</pre>
</div>

<p>
Create a DOS partition table and a primary partition on the entire image,
then format the new created partition with the <code>ext4</code> file system:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #91b9c7;">echo</span> <span style="color: #fbaed2;">","</span> | sudo sfdisk $<span style="color: #47ba99;">dev</span>
sudo mke2fs <span style="color: #fbaed2;">"$dev"</span>p1
</pre>
</div>

<p>
Finally, you are done at modifying your image, detach it from the loopback
device:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo losetup -d $<span style="color: #47ba99;">dev</span>
</pre>
</div>

<p>
Now, you have a persistent file that will hold your files for the
simulation. Define a function that will be used each time you need to
update the image with new files (binaries, data&#x2026;):
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #697375;"># </span><span style="color: #697375;">$1: workload image name/path.</span>
<span style="color: #697375;"># </span><span style="color: #697375;">$*: list of files to copy.</span>
<span style="color: #91b9c7;">workload_update</span><span style="color: #4EB8CA;">()</span> <span style="color: #4EB8CA;">{</span>
    <span style="color: #47ba99;">dev</span>=$<span style="color: #91b9c7;">(</span>sudo losetup -f<span style="color: #91b9c7;">)</span>
    <span style="color: #47ba99;">mnt</span>=/mnt/workload
    <span style="color: #697375;"># </span><span style="color: #697375;">Get arguments.</span>
    <span style="color: #47ba99;">img</span>=<span style="color: #fbaed2;">"$1"</span>
    <span style="color: #91b9c7;">shift</span>
    <span style="color: #697375;"># </span><span style="color: #697375;">Create the mount folder and the loop device.</span>
    sudo mkdir -p $<span style="color: #47ba99;">mnt</span>
    sudo losetup -fP <span style="color: #fbaed2;">"$img"</span>
    <span style="color: #697375;"># </span><span style="color: #697375;">Mount the block device.</span>
    sudo mount -o loop $<span style="color: #47ba99;">dev</span> $<span style="color: #47ba99;">mnt</span>
    <span style="color: #697375;"># </span><span style="color: #697375;">Copy files/folders.</span>
    sudo cp -r -f -t $<span style="color: #47ba99;">mnt</span> $<span style="color: #47ba99;">*</span>
    <span style="color: #697375;"># </span><span style="color: #697375;">List the files to confirm.</span>
    ls -alh $<span style="color: #47ba99;">mnt</span>
    <span style="color: #697375;"># </span><span style="color: #697375;">Unmount the image and freed the loop device.</span>
    sudo umount $<span style="color: #47ba99;">mnt</span>
    sudo losetup -d $<span style="color: #47ba99;">dev</span>
<span style="color: #4EB8CA;">}</span>
</pre>
</div>

<p>
We will use this function later. All your 3 images will be mounted directly
in the simulated system by gem5 itself, and the files in the workload image
will be accessible in read/write. This is an efficient and handy way to
communicate with a gem5 simulation.
</p>
</div>
</div>
