docs/index.org
** How to Simulate Spectre with gem5
   :PROPERTIES:
   :CUSTOM_ID: howto_gem5
   :END:

   We assume that you are able to compile and know how to perform a Spectre
   attack with our binary (at least in theory), described in Section
   [[#howto_spectre]].

   We assume that your gem5 setup is ready to perform a full-system simulation,
   described in Section [[#howto_gem5_setup]].

   The first step is to copy the Spectre binary on the =workload.img=
   image. Use our predefined function for that:

   #+BEGIN_SRC bash :eval never
   cd "$reproduce_repo"
   workload_update "$gem5_repo/$img_dir/$img" spectre/spectre
   #+END_SRC

   Then, we will launch the simulation of our system, described in Section
   [[#implem_gem5]], with gem5:

   #+BEGIN_SRC bash :eval never
   cd gem5
   #+END_SRC

** How to Visualize the Pipeline of a gem5 Processor with Konata
   :PROPERTIES:
   :CUSTOM_ID: howto_konata
   :END:

* Implementations

  Implementation details goes here.

** Spectre
   :PROPERTIES:
   :CUSTOM_ID: implem_spectre
   :END:
   
   Our implementation resides in the =spectre= directory of the repository:

   #+BEGIN_SRC bash :dir ../ :results output :exports results
   tree spectre
   #+END_SRC

   #+RESULTS:
   #+begin_example
   spectre
   ├── asm.c
   ├── asm.h
   ├── main.c
   ├── Makefile
   ├── perf.c
   ├── perf.h
   ├── spectre_pht_sa_ip.c
   ├── spectre_pht_sa_ip.h
   ├── util.c
   └── util.h

   0 directories, 10 files
   #+end_example

   It is composed of the following modules:
   - =asm= :: ARM assembly implementation.
   - =main= :: Orchestrate all the modules.
   - =perf= :: =perf_event= wrapper.
   - =spectre_pht_sa_ip= :: Spectre implementation (for the PHT-SA-IP
     version).
   - util :: Useful functions used across the binary.

   Note that:
   - There is a lot of comments into the code, don't hesitate to look at it to
     understands specific parts of the Spectre attack or the assembly
     instructions.

** gem5
   :PROPERTIES:
   :CUSTOM_ID: implem_gem5
   :END:

   # TODO The first boot is with a simple cpu, a restoration is with the full
   # CPU.
   
   To understand what the patch does and how it works, see our corresponding
   [[https://stackoverflow.com/questions/63988672/using-perf-event-with-the-arm-pmu-inside-gem5][StackOverflow post]] or our [[https://www.mail-archive.com/gem5-users@gem5.org/msg18401.html][ticket on the gem5 mailing list]].

* Appendices

  - If you are a gem5 user who experience some unresolved errors, you could
    check the [[https://pierreay.github.io/reproduce-spectre-gem5/gem5_errors.html#runtime][=docs/gem5_errors.html=]] file.
