docs/index.html

<div id="outline-container-howto_gem5" class="outline-3">
<h3 id="howto_gem5"><span class="section-number-3">3.4</span> How to Simulate Spectre with gem5</h3>
<div class="outline-text-3" id="text-howto_gem5">
<p>
We assume that you are able to compile and know how to perform a Spectre
attack with our binary (at least in theory), described in Section
<a href="#howto_spectre">3.2</a>.
</p>

<p>
We assume that your gem5 setup is ready to perform a full-system simulation,
described in Section <a href="#howto_gem5_setup">3.3</a>.
</p>

<p>
The first step is to copy the Spectre binary on the <code>workload.img</code>
image. Use our predefined function for that:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #91b9c7;">cd</span> <span style="color: #fbaed2;">"$reproduce_repo"</span>
workload_update <span style="color: #fbaed2;">"$gem5_repo/$img_dir/$img"</span> spectre/spectre
</pre>
</div>

<p>
Then, we will launch the simulation of our system, described in Section
<a href="#implem_gem5">4.2</a>, with gem5:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #91b9c7;">cd</span> gem5
</pre>
</div>
</div>
</div>

<div id="outline-container-howto_konata" class="outline-3">
<h3 id="howto_konata"><span class="section-number-3">3.5</span> How to Visualize the Pipeline of a gem5 Processor with Konata</h3>
<div class="outline-text-3" id="text-howto_konata">
</div>
</div>
</div>

<div id="outline-container-org1041c95" class="outline-2">
<h2 id="org1041c95"><span class="section-number-2">4</span> Implementations</h2>
<div class="outline-text-2" id="text-4">
<p>
Implementation details goes here.
</p>
</div>

<div id="outline-container-implem_spectre" class="outline-3">
<h3 id="implem_spectre"><span class="section-number-3">4.1</span> Spectre</h3>
<div class="outline-text-3" id="text-implem_spectre">
<p>
Our implementation resides in the <code>spectre</code> directory of the repository:
</p>

<pre class="example" id="org73a7443">
spectre
├── asm.c
├── asm.h
├── main.c
├── Makefile
├── perf.c
├── perf.h
├── spectre_pht_sa_ip.c
├── spectre_pht_sa_ip.h
├── util.c
└── util.h

0 directories, 10 files
</pre>

<p>
It is composed of the following modules:
</p>
<dl class="org-dl">
<dt><code>asm</code></dt><dd>ARM assembly implementation.</dd>
<dt><code>main</code></dt><dd>Orchestrate all the modules.</dd>
<dt><code>perf</code></dt><dd><code>perf_event</code> wrapper.</dd>
<dt><code>spectre_pht_sa_ip</code></dt><dd>Spectre implementation (for the PHT-SA-IP
version).</dd>
<dt>util</dt><dd>Useful functions used across the binary.</dd>
</dl>

<p>
Note that:
</p>
<ul class="org-ul">
<li>There is a lot of comments into the code, don't hesitate to look at it to
understands specific parts of the Spectre attack or the assembly
instructions.</li>
</ul>
</div>
</div>

<div id="outline-container-implem_gem5" class="outline-3">
<h3 id="implem_gem5"><span class="section-number-3">4.2</span> gem5</h3>
<div class="outline-text-3" id="text-implem_gem5">
<p>
To understand what the patch does and how it works, see our corresponding
<a href="https://stackoverflow.com/questions/63988672/using-perf-event-with-the-arm-pmu-inside-gem5">StackOverflow post</a> or our <a href="https://www.mail-archive.com/gem5-users@gem5.org/msg18401.html">ticket on the gem5 mailing list</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org166628e" class="outline-2">
<h2 id="org166628e"><span class="section-number-2">5</span> Appendices</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>If you are a gem5 user who experience some unresolved errors, you could
check the <a href="https://pierreay.github.io/reproduce-spectre-gem5/gem5_errors.html#runtime"><code>docs/gem5_errors.html</code></a> file.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pierre Ayoub</p>
<p class="date">Created: 2021-04-07 mer. 10:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
